Revit 2024 API
BuiltInFailures.ElectricityFailures.InvalidPoleNumber Property
 The panel is single phase [wire] wires. The number of poles can not be larger than [value].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidPoleNumber { get; }
Visual Basic
Public Shared ReadOnly Property InvalidPoleNumber As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidPoleNumber {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElectricityFailures Class
Autodesk.Revit.DB Namespace